RESTAssured/SoapRequest/Add.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <Add xmlns="http://tempuri.org/">
            <intA>2</intA>
            <intB>3</intB>
        </Add>
    </soap:Body>
</soap:Envelope>